const readline = require("readline");

const rl = readline.createInterface({
  input: process.stdin,
  output: process.stdout,
});

console.clear();
rl.question("กรุณาใส่จำนวนหน่วยการใช้ไฟฟ้า: ", (answer) => {
  let units = parseFloat(answer);
  let cost = 0;

  if (units <= 5) {
    cost = units * 0;
  } else if (units <= 15) {
    cost = 5 * 0 + (units - 5) * 1.3576;
  } else if (units <= 25) {
    cost = 5 * 0 + 10 * 1.3576 + (units - 15) * 1.5445;
  } else if (units <= 35) {
    cost = 5 * 0 + 10 * 1.3576 + 10 * 1.5445 + (units - 25) * 1.7968;
  } else if (units <= 100) {
    cost =
      5 * 0 + 10 * 1.3576 + 10 * 1.5445 + 10 * 1.7968 + (units - 35) * 2.18;
  } else if (units <= 150) {
    cost =
      5 * 0 +
      10 * 1.3576 +
      10 * 1.5445 +
      10 * 1.7968 +
      65 * 2.18 +
      (units - 100) * 2.2734;
  } else if (units <= 400) {
    cost =
      5 * 0 +
      10 * 1.3576 +
      10 * 1.5445 +
      10 * 1.7968 +
      65 * 2.18 +
      50 * 2.2734 +
      (units - 150) * 2.7781;
  } else {
    cost =
      5 * 0 +
      10 * 1.3576 +
      10 * 1.5445 +
      10 * 1.7968 +
      65 * 2.18 +
      50 * 2.2734 +
      250 * 2.7781 +
      (units - 400) * 2.978;
  }

  if (units <= 150) {
    cost += 8.19;
  }

  console.log(`ค่าไฟฟ้ารวม = ${cost.toFixed(2)} บาท`);

  rl.close();
});

// 0 - 5 หน่วย: ค่าไฟฟ้า = 0.0000 บาท/หน่วย
// 6 - 15 หน่วย: ค่าไฟฟ้า = 1.3576 บาท/หน่วย
// 16 - 25 หน่วย: ค่าไฟฟ้า = 1.5445 บาท/หน่วย
// 26 - 35 หน่วย: ค่าไฟฟ้า = 1.7968 บาท/หน่วย
// 36 - 100 หน่วย: ค่าไฟฟ้า = 2.1800 บาท/หน่วย
// 101 - 150 หน่วย: ค่าไฟฟ้า = 2.2734 บาท/หน่วย
// 151 - 400 หน่วย: ค่าไฟฟ้า = 2.7781 บาท/หน่วย
// มากกว่า 400 หน่วย: ค่าไฟฟ้า = 2.9780 บาท/หน่วย
